dctime/Minecraft-2D/GLCD/stm324xg_lcd_ILI9328.c
	wr_Timing.AddressSetupTime = 11;		// templet: 15
  wr_Timing.AddressHoldTime = 0;
  wr_Timing.DataSetupTime = 11;		// templet: 60
  wr_Timing.BusTurnAroundDuration = 0;
  wr_Timing.CLKDivision = 0;
  wr_Timing.DataLatency = 0;
  wr_Timing.AccessMode = FSMC_ACCESS_MODE_A;

  // Initialize SRAM control Interface BCTR[(NEx-1)*2]
  FSMC_NORSRAM_Init(FSMC_Bank1, &hsram4_Init);
	// FSMC_Bank1: FSMC Bank1 registers base address = 0xA0000000UL

  // Initialize SRAM timing Interface BCTR[(NEx-1)*2 + 1]
  FSMC_NORSRAM_Timing_Init(FSMC_Bank1, &wr_Timing, FSMC_Bank1_NEx); 

  if(hsram4_Init.ExtendedMode == FSMC_EXTENDED_MODE_ENABLE)
  {
		w_Timing.AddressSetupTime = 9;
		w_Timing.AddressHoldTime = 0;
		w_Timing.DataSetupTime = 8;
		w_Timing.BusTurnAroundDuration = 0;
		w_Timing.CLKDivision = 0;
		w_Timing.DataLatency = 0;
		w_Timing.AccessMode = FSMC_ACCESS_MODE_A;
  // Initialize SRAM extended mode timing Interface BWTR[(NEx-1)*2]
		FSMC_NORSRAM_Extended_Timing_Init(FSMC_Bank1E, &w_Timing, FSMC_Bank1_NEx,  FSMC_EXTENDED_MODE_ENABLE);  
  } else
	{
		    FSMC_Bank1E->BWTR[FSMC_Bank1_NEx] = 0x0FFFFFFFU;	// reset value
	}
  /* Enable FSMC NOR/SRAM Bank1 */
		__FSMC_NORSRAM_ENABLE(FSMC_Bank1, FSMC_Bank1_NEx); 
		//FSMC_Bank1->BTCR[FSMC_Bank1_NEx] |=  FSMC_BCR1_MBKEN;  // bit0: FSMC_BCR1_MBKEN;
}

/********************************************************************************************************
*  Function: GPIO_outPPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: GPIO_x                                  
********************************************************************************************************/
static GPIO_TypeDef* GPIO_outPPhigh(uint32_t PortNum, uint32_t PinNum)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t y=PinNum;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

    GPIO_x->MODER   = (GPIO_x->MODER & ~Bit((y*2+1)) )  | Bit(y*2); //Output mode (01b)
    GPIO_x->OSPEEDR = (GPIO_x->OSPEEDR |  (0x03ul<<(y*2)) ); //high speed (11b)
    GPIO_x->OTYPER  &= ~Bit(y);                      // push-pull (0b)
    GPIO_x->PUPDR   &= ~(0x03ul<<(y*2));       //NO pull (00b)
  if (y < 8)
    GPIO_x->AFR[0]  &= ~(0x0Ful<<(y*4));      // AF0
  else
    GPIO_x->AFR[1]  &= ~(0x0Ful<<((y-8)*4));  // AF0
	
		return GPIO_x;
}

/********************************************************************************************************
*  Function: GPIO_AF12PPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: none                                  
********************************************************************************************************/
static void GPIO_AF12PPhigh(uint32_t PortNum, uint32_t PinBit)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t temp, chg1= PinBit, chg2=0, chg4L=0, chg4H=0;
	uint32_t fill2=0, fill4L=0, fill4H=0;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

  
	for (temp=0; temp<16; temp++){
			if (PinBit & 0x01){
			   chg2 |= (0x03ul) << (temp*2);
			   fill2 |= (0x02ul) << (temp*2);
			  if (temp <8){
			   chg4L |= (0x0Ful) << (temp*4);
			   fill4L |= (0x0Cul) << (temp*4);
			  }else {
			   chg4H |= (0x0Ful) << ((temp-8)*4);
			   fill4H |= (0x0Cul) << ((temp-8)*4);
			  }				
		  }
			PinBit = PinBit >> 1;
	}

		GPIO_x->MODER   = (GPIO_x->MODER & ~chg2)  | fill2; //AF mode (10b)
    GPIO_x->OSPEEDR = (GPIO_x->OSPEEDR |  chg2 ); //high speed (11b)
    GPIO_x->OTYPER  &= ~chg1;                      // push-pull (0b)
    GPIO_x->PUPDR   &= ~chg2;       //NO pull (00b)
  if (chg4L)
	{
    temp = GPIO_x->AFR[0];
    temp &= ~chg4L;						// clear to 0000b
		GPIO_x->AFR[0] = (temp | fill4L);      // AF12  (1100b)
	}
	if (chg4H)
	{
    temp = GPIO_x->AFR[1];
    temp &= ~chg4H;						// clear to 0000b
		GPIO_x->AFR[1] = (temp | fill4H);      // AF12  (1100b)
	}
}

/********************************************************************************************************
*  Function: delay_ms				                                                           
*  Object: lcd init wait..
*  Input: Num
*  Output: none                                  
*  brief: time = Num * 1ms
********************************************************************************************************/
__WEAK void delay_ms(uint16_t Num)
{
		volatile uint16_t Timer;
		while(Num--)
		{
		 	Timer = 11500;
			while(Timer--); 
		}
}

/********************************************************************************************************
*  Function: LCD_Reset				                                                           
*  Object: lcd reset control
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Reset(void)
{
#if USE_resetPIN
		LCD_RESET_L;
		delay_ms(150);		// 150 ms
		LCD_RESET_H;
		delay_ms(50);	// 50 ms
#endif
}

void LCD_WriteRegX(uint16_t LCD_Reg, uint16_t LCD_RegValue)
{	
		LCD_WriteReg(LCD_Reg);  // Register Code
		LCD_WriteData(LCD_RegValue); // Data Code
}	   

/********************************************************************************************************
*  Function: LCD_DisplayDevID				                                                           
*  Object: Display LCD device ID on the screen
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_DisplayDevID()
{	
#include <stdio.h>
  char p_text[13] = "";
	sprintf(p_text,"LCD ID: %04X",lcd_id);	//LCD ID			 	
	LCD_DisplayStringLineCol(1, 2, p_text);		// line 0, column 2
}	   

uint16_t GRAM_mode;
/********************************************************************************************************
*  Function: ILI9328				                                                           
*  Object: lcd initialization
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void ILI9328(void)
{
//	if(lcddev.id==0x9328)//ILI9328   OK  
  	LCD_WriteRegX(0x00EC,0x108F);// internal timing      
 		LCD_WriteRegX(0x00EF,0x1234);// ADD        
        LCD_WriteRegX(0x0001,0x0100);     
        LCD_WriteRegX(0x0002,0x0700);//電源開啟                    

	//DRIVE TABLE(寄存器 03H)
	/* ########################################
	Default XY: Portrait 1 (Logical (x, y) == Physical (X, Y))
	
 (Reset Key)     (USB Device) (On/Off switch)
 (0, 0) ---------- (219, 0)
        |   U    | 	
        |        | 	
   L    |        | 	R
        |        | 	
        |        | 	
        |   D    | 	
        ----------	(219, 319)
	
	         (STM32)
	//############################################
	*/
// bit: 5  4  3 
		//ID1/ID0 AM   FUNCTION
		//               x   y  (LCD coordinates)
		// 0  0   0	   R->L D->U (Portrait A)
		// 0  0   1	   D->U	R->L (Landscape A for bmp)
		// 0  1   0	   L->R D->U 
		// 0  1   1    D->U	L->R (Landscape A)
		// 1  0   0	   R->L U->D (Portrait A for bmp)
		// 1  0   1    U->D	R->L (Landscape B)
		// 1  1   0    L->R U->D (Portrait B; default XY coordinates)
		// 1  1   1	   U->D	L->R
  #if (LANDSCAPE == 1)
	// #### Landscape A ########
    // AM=1   (address is updated in vertical writing direction)    
		GRAM_mode = Bit(12)|(0x01<<4)| Bit(3); //BGR=1 (bit 12); I/D = 01b (bits 5:4) ; AM = 1 (bit 3)   
		LCD_WriteRegX(0x0003, GRAM_mode);
		// bit 12 (BGR) = 1: (Blue:Green:Red)
		// bit 3 (column and row exchange) = 1
		// bit 4 (X: column addr. order) = 1   rightward: 0 ==> width
    // bit 5 (Y: page (row) addr. order) = 0  upward: height ==> 0
		//
		//   --------------------> page (x)
		//   |
		//   |
		//   \/
		//   column (y) 
		//
  #else
    // AM=0   (address is updated in horizontal writing direction)            
//		LCD_WriteData(0xC8);	// bit 7, 6, 3 = 1  
	// #### Portait B ########
//		GRAM_mode = Bit(12)|(0x03<<4)|(0<<3); //BGR=1 (bit 12); I/D = 11b (bits 4:5) ; AM = 0 (bit 3)   
	// #### Portait A ########
		GRAM_mode = Bit(12)|(0x00<<4)|(0<<3); //BGR=1 (bit 12); I/D = 00b (bits 4:5) ; AM = 0 (bit 3)   
		LCD_WriteRegX(0x0003, GRAM_mode);
		// bit 12 (BGR) = 1
		// bit 4 (column addr. order) = 1   upward: width ==> 0
    // bit 5 (page (row) addr. order) = 1  rightward: height ==> 0
		// bit 3 (column and row exchange) = 0 (no)
		// bit 4 (X: column addr. order) = 1   rightward: 0 ==> width 
    // bit 5 (Y: page (row) addr. order) = 1  downward: 0 ==> height
		//
		//   column (x) 
		//   ^
		//   |
		//   |
		//   --------------------> page (y)
		//
  #endif
				LCD_WriteRegX(0x0004,0x0000);                                   
        LCD_WriteRegX(0x0008,0x0202);	           
        LCD_WriteRegX(0x0009,0x0000);         
        LCD_WriteRegX(0x000a,0x0000);//display setting         
        LCD_WriteRegX(0x000c,0x0001);//display setting          
        LCD_WriteRegX(0x000d,0x0000);//0f3c          
        LCD_WriteRegX(0x000f,0x0000);
		//電源配置
        LCD_WriteRegX(0x0010,0x0000);   
        LCD_WriteRegX(0x0011,0x0007);
        LCD_WriteRegX(0x0012,0x0000);                                                                 
        LCD_WriteRegX(0x0013,0x0000);                 
				// ==> LCD_DisplayOff(); // LCD_WriteRegX(0x0007,0x0001);
//When the display is turned off by setting D[1:0] = 01, the ILI9328 continues internal display operation. 		
				LCD_WriteRegX(0x0007,0x0001);  // D[1:0] = 01b              
       	delay_ms(50); 
        LCD_WriteRegX(0x0010,0x1490);   
        LCD_WriteRegX(0x0011,0x0227);
        delay_ms(50); 
        LCD_WriteRegX(0x0012,0x008A);                  
        delay_ms(50); 
        LCD_WriteRegX(0x0013,0x1a00);   
        LCD_WriteRegX(0x0029,0x0006);
        LCD_WriteRegX(0x002b,0x000d);
        delay_ms(50); 
        LCD_WriteRegX(0x0020,0x0000);   // Cursor X = 0                                                         
        LCD_WriteRegX(0x0021,0x0000);   // Cursor Y = 0 
		delay_ms(50); 
		//伽馬校正
        LCD_WriteRegX(0x0030,0x0000); 
        LCD_WriteRegX(0x0031,0x0604);   
        LCD_WriteRegX(0x0032,0x0305);
        LCD_WriteRegX(0x0035,0x0000);
        LCD_WriteRegX(0x0036,0x0C09); 
        LCD_WriteRegX(0x0037,0x0204);
        LCD_WriteRegX(0x0038,0x0301);        
        LCD_WriteRegX(0x0039,0x0707);     
        LCD_WriteRegX(0x003c,0x0000);
        LCD_WriteRegX(0x003d,0x0a0a);
        delay_ms(50); 
        LCD_WriteRegX(0x0050,0x0000); //水準GRAM起始位置 
        LCD_WriteRegX(0x0051,0x00ef); //水準GRAM終止位置: 0xEF = 239                  
        LCD_WriteRegX(0x0052,0x0000); //垂直GRAM起始位置                    
        LCD_WriteRegX(0x0053,0x013f); //垂直GRAM終止位置: 0x013F = 319  
 
        LCD_WriteRegX(0x0060,0xa700);        
				LCD_WriteRegX(0x0061,0x0001); // REV = 1 (bit 0): No inversion
        LCD_WriteRegX(0x006a,0x0000);
        LCD_WriteRegX(0x0080,0x0000);
        LCD_WriteRegX(0x0081,0x0000);
        LCD_WriteRegX(0x0082,0x0000);
        LCD_WriteRegX(0x0083,0x0000);
        LCD_WriteRegX(0x0084,0x0000);
        LCD_WriteRegX(0x0085,0x0000);
      
        LCD_WriteRegX(0x0090,0x0010);     
        LCD_WriteRegX(0x0092,0x0600);  
        //開啟顯示設定    
				// ==> LCD_DisplayOn();
        LCD_WriteRegX(0x0007,0x0133); // Normal Display: BASEE=1; GON=1; DTE=1; D[1:0] = 11b
}
/********************************************************************************************************
*  Function: LCD_Init				                                                           
*  Object: lcd initialization
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Init(void)
{ 
	volatile uint16_t data1;
		//-- LCD PORT INIT --
//		LCD_PortInit();
		GPIO_backlight = GPIO_outPPhigh(PNr_backlight, PIN_bl);	// backlight pin (LIG): PB0
		GPIO_reset = GPIO_outPPhigh(PNr_reset, PIN_rs);  				// reset pin (RST): PC5
		if (PinBit_FSMC_set1)	GPIO_AF12PPhigh(PNr_FSMC_set1, PinBit_FSMC_set1);
		if (PinBit_FSMC_set2)	GPIO_AF12PPhigh(PNr_FSMC_set2, PinBit_FSMC_set2);
		if (PinBit_FSMC_set3)	GPIO_AF12PPhigh(PNr_FSMC_set3, PinBit_FSMC_set3);
		if (PinBit_FSMC_set4)	GPIO_AF12PPhigh(PNr_FSMC_set4, PinBit_FSMC_set4);
/*  GPIOD: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin: PD |   0   1    4    5       8    9   10   14   15
    | GLCD    |  D2  D3   (RD) (WR)    D13  D14  D15  D0   D1
	  --------------------------------------------------------------
    GPIOE: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin: PE |    7   8   9   10  11  12  13   14   15
    | GLCD    |   D4  D5  D6  D7  D8  D9  D10  D11  D12
	  --------------------------------------------------------------
   GPIOG: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin : PG |   0         12
    | GLCD     |  (RS)      (CS)
	            (FSMC_A10)  (FSMC_NE4)
	  --------------------------------------------------------------
*/

	
		LCD_FSMCConfig();

