dctime/Minecraft-2D/GLCD/stm324xg_lcd_ILI9328.c
		//-- LCD RESET--
		LCD_Reset();
	// ######### Read ID, just for test ##################
		LCD_WriteReg(0x00);	// 0x00: get Chip Driver ID Code
 		data1 = LCD_ReadData;				// driver ID (0x9328)
		//-------------- Initial Sequence ---------------
		//************* Start Initial Sequence **********//	
		if(data1==0x9328)//ILI9328   OK  
		{
			ILI9328();
			lcd_id = data1;
		} else
		{
			while(1);
		}

	//----- setting the following initial variables:
	//----- Current font
	//----- wf, hf, bytes_wf, bytes_f
	LCD_SetFont( &LCD_DEFAULT_FONT);
	//----- text color; background color
	LCD_SetColors(Default_TextColor, Default_BackColor);
		
		LCD_Clear(Default_BackColor);
    delay_ms(50); 
#if Show_DeviceID
		LCD_DisplayDevID();
#endif
		LCD_DisplayOn();
}

/********************************************************************************************************
*  Function: LCD_OpenWin		(ILI9328)		                                                           
*  Object: lcd open window for display
*  Input: x0,y0, x1, y1
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_OpenWin(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	uint16_t cX, cY;
	
	if (x0 > x1) x1 = x0;
	else if (x1 > LCD_PIXEL_WIDTH) x1 = LCD_PIXEL_WIDTH; 
	if (y0 > y1) y1 = y0;
	else if (y1 > LCD_PIXEL_HEIGHT) y1 = LCD_PIXEL_HEIGHT; 
#if (LANDSCAPE == 1)
	// ########## For Landscape A #############
	// logical x (--> rightward increase): Physical Y  (<--- rightward decrease: 0 to 319)
	// logical y (downward increase): Physical X  (downward increase: 0 to 239)
	uint16_t tmp;

		tmp = x0;
		x0 = y0;		// i.e., X0
		y0 = LCD_PIXEL_WIDTH - x1;	// i.e., Y0	
		x1 = y1;		// i.e., X1
		y1 = LCD_PIXEL_WIDTH - tmp;	// i.e., Y1	
		cX = x0;		// x0 at X0
		cY = y1;		// y0 at Y1
#else
	// ########## For Portrait A #############
	// logical x (--> rightward increase): Physical X  (---> rightward decrease: 239 to 0)
	// logical y (downward increase): Physical Y  (downward decrease: 319 to 0)
	uint16_t tmp;
		tmp = x0;
		x0 = LCD_PIXEL_WIDTH - x1;	// i.e., X0	
		x1 = LCD_PIXEL_WIDTH - tmp;	// i.e., X1	
		tmp = y0;
		y0 = LCD_PIXEL_HEIGHT - y1;	// i.e., Y0	
		y1 = LCD_PIXEL_HEIGHT - tmp;	// i.e., Y1	
		cX = x1;		// x0 at X1
		cY = y1;	  // y0 at Y1
#endif
	
		LCD_WriteReg(0x50);					// X-start Set (50h)
		LCD_WriteData(x0);
		LCD_WriteReg(0x51);					// X-end Set (51h)
		LCD_WriteData(x1);		
		LCD_WriteReg(0x52);				// Y-start Set (52h) 
		LCD_WriteData(y0);
		LCD_WriteReg(0x53);				// Y-end Set (53h) 
		LCD_WriteData(y1);

	// Set start cursor point
		LCD_WriteReg(0x20);				// set cursor X 
		LCD_WriteData(cX);
		LCD_WriteReg(0x21);				// set cursor Y 
		LCD_WriteData(cY);

		LCD_WriteReg(0x22);				// Write Data to GRAM (R22h) 
}

/********************************************************************************************************
*  Function: LCD_toPortrait			(ILI9328)		                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toPortrait(void)
{
	// #### Portait 1 ########
//		LCD_WriteRegX(0x0003, (Bit(12)|(0x03<<4)|(0<<3)));
	// #### Portait 0 ########
		LCD_WriteRegX(0x0003, (Bit(12)|(0x00<<4)|(0<<3)));
}
/********************************************************************************************************
*  Function: LCD_toLandscape			(ILI9328)		                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toLandscape(void)
{
		LCD_WriteRegX(0x0003, (Bit(12)|(0x01<<4)| Bit(3)));
}
/********************************************************************************************************
*  Function: LCD_toDefaultDisDirection		(ILI9328)			                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toDefaultDisDirection(void)
{
		LCD_WriteRegX(0x0003, GRAM_mode);
}

/********************************************************************************************************
*  Function: LCD_Clear				                                                           
*  Object: lcd clear screen
*  Input: backcolor
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Clear(uint16_t BackColor)
{
		uint16_t i,j;
		LCD_OpenWin(0, 0, LCD_COL_NUM-1, LCD_ROW_NUM-1);
	
		for(i = 0; i < LCD_ROW_NUM; i++)
			 for(j =0; j < LCD_COL_NUM; j++)
					 LCD_WriteData(BackColor);
}

/**
  * @brief  Enable the Display. (ILI9328)
  * @param  None
  * @retval None
  */
void LCD_DisplayOn(void)
{
 	//---- turn on backlight ----------
	LCD_turnON_backlight;			// //   GPIOB->BSRR = 0x01;
	
  /* Display On */
  LCD_WriteRegX(0x0007,0x0133); // Normal Display: BASEE=1; GON=1; DTE=1; D[1:0] = 11b
}

/**
  * @brief  Disable the Display. (ILI9328)
  * @param  None
  * @retval None
  */
void LCD_DisplayOff(void)
{
  /* Display Off */
	LCD_WriteRegX(0x0007,0x0001);   // D[1:0] = 01b
//When the display is turned off by setting D[1:0] = 01, the ILI9328 continues internal display operation. 		
	//---- turn off backlight ----------
	LCD_turnOFF_backlight;		//   GPIOB->BSRR = 0x01<<16;	
}

//###########################################################
//
//     Hardware Abstract Layer
//
//###########################################################
/**
  * @brief  Sets a display window by width (w) and height (h)
  *
*/
#define LCD_DisplayWindow_WnH(x, y, w, h)  LCD_OpenWin(x, y, x+w-1, y+h-1)


/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  DrawProp.TextColor = _TextColor;
  DrawProp.BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = DrawProp.TextColor; 
	*_BackColor = DrawProp.BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  DrawProp.TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  DrawProp.BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *pfonts)
{
	DrawProp.pFont	= pfonts;	// pLCD_Currentfonts = pfonts;
	//----- modified by Shir-Kuan Lin
	wf = pfonts->Width; 	// font_width
	hf = pfonts->Height; // font_height
	bytes_wf = (wf+7) /8;	// number of bytes per width line in a font
	bytes_f = hf * bytes_wf;	// number of bytes per font (see Font12_Table or Font20_Table)
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return pLCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearStringLine(uint16_t LineNr)
{
  uint16_t bColor;
  uint16_t x, y;
	if (((LineNr+1) * pLCD_Currentfonts->Height) > (LCD_PIXEL_HEIGHT)){
		return;
	}
	LineNr = LineNr * pLCD_Currentfonts->Height;
	bColor = DrawProp.BackColor;
	
	LCD_OpenWin(0, LineNr, LCD_PIXEL_WIDTH, LineNr+hf-1);
  for(y = 0; y < hf; y++)		
  {
		for(x = 0; x <= LCD_PIXEL_WIDTH; x++)
		{
			LCD_WriteData(bColor);
		}
	}
}

/********************************************************************************************************
*  Function: LCD_DisplayChar				                                                           
*  Object: Display an ASCII character
*  Input: start point, end point, ASCII code, text color, background color
*  Output: none                                  
*  brief: none
********************************************************************************************************/
static void LCD_DisplayChar(uint16_t Xpos, uint16_t Ypos,  uint8_t Ascii, uint16_t fColor, uint16_t bColor)
{
	// wf =: font_width,
	// hf =:  font_height
// bytes_wf = number of bytes per width line in a font
// bytes_f  = number of bytes per font

	int	iw;
  uint32_t byteNr, jw;
	uint16_t  hp_limit;
	const uint8_t *c;
	
	if((Ascii > '~') || (Ascii < ' ')) Ascii= ' ';
		
	iw = Ascii - 32;  // make ' ' (space) at offset of 0
  c = &pLCD_Currentfonts->table[iw * bytes_f];	
	
